# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# backbone:结构化，head:非结构化

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4

   [-1, 1, RepNCSPELAN4, [64, 32, 32, 1, nn.LeakyReLU(0.1)]], # 2

   [-1, 1, MP, []],  # 3-P3/8
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1, nn.LeakyReLU(0.1)]], # 4

   [-1, 1, MP, []],  # 5-P4/16
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1, nn.LeakyReLU(0.1)]], # 6

   [-1, 1, MP, []],  # 7-P5/32
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1, nn.LeakyReLU(0.1)]], # 8
  ]

# yolov7-tiny head
head:
  # SPPCSPC-tiny
  [ [ -1, 1, Conv, [ 256, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ], # new 29-37    (9-17)
    [ -2, 1, Conv, [ 256, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
    [ -1, 1, SP, [ 5 ] ],
    [ -2, 1, SP, [ 9 ] ],
    [ -3, 1, SP, [ 13 ] ],
    [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
    [ [ -1, -7 ], 1, Concat, [ 1 ] ],
    [ -1, 1, Conv, [ 256, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 37



   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [6, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1, nn.LeakyReLU(0.1)]], # 14 (22)

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [4, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, RepNCSPELAN4,[64, 32, 32, 1, nn.LeakyReLU(0.1)]], # 19  (27)

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 22], 1, Concat, [1]],
   [-1, 1, RepNCSPELAN4, [128, 64, 32, 1, nn.LeakyReLU(0.1)]], # 22 (30)

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1, nn.LeakyReLU(0.1)]], # 25 (33)

   [27, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 26-P3  (34)
   [30, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 27-P4  (35)
   [33, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 28-P5  (36)

   [[34, 35, 36], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
