# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True    args[numbers,size,stride,padding,g,activite]
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4    
   # ELAN-tiny
   [-1, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 2-7
   [-2, 1, Conv, [32, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [32, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 7
   
   [-1, 1, MP, []],  # 8-P3/8  8 mp
   # ELAN-tiny
   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], #9-14
   [-2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [64, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 14
   
   [-1, 1, MP, []],  # 15-P4/16
   # ELAN-tiny
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], #16-21
   [-2, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 21
   
   [-1, 1, MP, []],  # 22-P5/32   # 22 mp
    # ELAN-tiny
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], #23-28
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 28
  ]

# yolov7-tiny head
head:
  # SPPCSPC-tiny
  [[-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]], #29-37
   [-2, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1, None, 1, nn.LeakyReLU(0.1)]],  # 37
   [[7, 14, 21, 28], 1, SimFusion_4in, []], # 10 (38)
   [-1, 1, IFM, [[64, 32]]],  # 11 (39)


   [37, 1, Conv, [256, 1, 1]], # 12 *  [9,1] (40)
   [[14, 21, -1], 1, SimFusion_3in, [256]], # 13
   [[-1, 39], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 0]], # 14
    # ELAN-tiny
   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 42-47 (43-48)
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 47 (48)

   [ 21, 1, Conv, [ 128, 1, 1 ] ], # 16 @@@ (49)
   [ [ 7, 14, -1 ], 1, SimFusion_3in, [ 128 ] ], # 17
   [ [ -1, 39 ], 1, InjectionMultiSum_Auto_pool, [ 128, [ 64, 32 ], 1 ] ], # 18
    # ELAN-tiny
   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 42-47 (52-57)
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  #

   [ [ 57, 48, 37 ], 1, PyramidPoolAgg, [ 352, 2 ] ], # 20
   [ -1, 1, TopBasicLayer, [ 352, [ 64, 128 ] ] ], # 21 (59)


   [ [ 57, 49 ], 1, AdvPoolFusion, [ ] ], # 22 ^^^
   [ [ -1, 59 ], 1, InjectionMultiSum_Auto_pool, [ 128, [ 64, 128 ], 0 ] ], # 23
    # ELAN-tiny
   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 42-47 (62-67)
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  #

   [ [ -1, 40 ], 1, AdvPoolFusion, [ ] ], # 25
   [ [ -1, 59 ], 1, InjectionMultiSum_Auto_pool, [ 256, [ 64, 128 ], 1 ] ], # 26
    # ELAN-tiny
   [ -1, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  # 42-47 (70-75)
   [ -2, 1, Conv, [ 64, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ -1, 1, Conv, [ 64, 3, 1, None, 1, nn.LeakyReLU(0.1) ] ],
   [ [ -1, -2, -3, -4 ], 1, Concat, [ 1 ] ],
   [ -1, 1, Conv, [ 128, 1, 1, None, 1, nn.LeakyReLU(0.1) ] ],  #



      
   [57, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 74
   [67, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 75
   [75, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 76

   [[76,77,78], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5) # 77
  ]
