# parameters
nc: 4 # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [ [ -1, 1, Conv, [ 16, 3, 2, 1 ] ],            # 0-P1/2  ch_out, kernel, stride, padding, groups 224*224*3
    [ -1, 1, G_bneck, [ 16, 16, 3, 1 ] ],        # 1  ch_out, ch_mid, dw-kernel, stride 112*112*16
    [ -1, 1, G_bneck, [ 24, 48, 3, 2 ] ],        # 2-P2/4   112*112*16
    [ -1, 1, G_bneck, [ 24, 72, 3, 1 ] ],        # 3         56*56*24
    [ -1, 1, G_bneck, [ 40, 72, 3, 2, True ] ],  # 4-P3/8    56*56*24
    [ -1, 1, G_bneck, [ 40, 120, 3, 1, True ] ], # 5         28*28*40
    [ -1, 1, G_bneck, [ 80, 240, 3, 2 ] ],        # 6-P4/16  28*28*40
    [ -1, 3, G_bneck, [ 80, 184, 3, 1 ] ],        # 7        14*14*80
    [ -1, 1, G_bneck, [ 112, 480, 3, 1, True ] ], # 8        14*14*80
    [ -1, 1, G_bneck, [ 112, 480, 3, 1, True ] ], # 9        14*14*80
    [ -1, 1, G_bneck, [ 160, 672, 3, 2, True ] ], # 10-P5/32 14*14*112
    [ -1, 1, G_bneck, [ 160, 960, 3, 1 ] ],       # 11        7*7*160
    [ -1, 1, G_bneck, [ 160, 960, 3, 1, True ] ], # 12        7*7*160
    [ -1, 1, G_bneck, [ 160, 960, 3, 1 ] ],       # 13        7*7*160
    [ -1, 1, G_bneck, [ 160, 960, 3, 1, True ] ], # 14        7*7*160
    [ -1, 1, Conv, [ 960 ] ],                     # 15        7*7*160
  ]

# yolov7-tiny head
head:
  [[-1, 1, SPPCSPCSIM, [256, nn.LeakyReLU(0.1)]], # 9-Yolov7-tiny-spp (16)

   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [9, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P4 (19)
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, yolov7_tiny_E_ELAN, [128, 64, nn.LeakyReLU(0.1)]], # 14 (21)

   [-1, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [5, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3 (24)
   [[-1, -2], 1, Concat, [1]],
   [-1, 1, yolov7_tiny_E_ELAN,[64, 32,nn.LeakyReLU(0.1)]], # 19 (26)

   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 21], 1, Concat, [1]],
   [-1, 1, yolov7_tiny_E_ELAN, [128, 64,  nn.LeakyReLU(0.1)]], # 22 (29)

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 16], 1, Concat, [1]],
   [-1, 1, yolov7_tiny_E_ELAN, [256, 128, nn.LeakyReLU(0.1)]], # 25 (32)

   [26, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 26-P3 (33)
   [29, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 27-P4 (34)
   [32, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 28-P5 (35)

   [[33, 34, 35], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]